In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
pd.options.plotting.backend = "plotly"

In [2]:
sales1 = pd.read_pickle("../Data/total_sales_09-10_cleaned.pkl")
sales2 = pd.read_pickle("../Data/total_sales_10-11_cleaned.pkl")

In [5]:
sales = pd.concat([sales1, sales2])

In [17]:
sales_day = sales.groupby(['date']).sum().reset_index()
sales_day = sales_day.drop(columns = ['hour'])
sales_day.head()

         date  total_amount
0  2009-12-01      37366.32
1  2009-12-02      45644.67
2  2009-12-03      66327.53
3  2009-12-04      31448.44
4  2009-12-05       9042.36

In [22]:
sales_day.to_pickle('../Data/sales_day.pkl')

In [3]:
sales1 = pd.read_pickle("../Data/total_sales_09-10_cleaned.pkl")
sales2 = pd.read_pickle("../Data/total_sales_10-11_cleaned.pkl")
sales = pd.concat([sales1, sales2])

In [4]:
sales

            date  weekday  hour  total_amount
0     2009-12-01  Tuesday     7        651.10
1     2009-12-01  Tuesday     9       4597.93
2     2009-12-01  Tuesday    10       4238.66
3     2009-12-01  Tuesday    11       4597.01
4     2009-12-01  Tuesday    12       8238.81
...          ...      ...   ...           ...
2814  2011-12-09   Friday     8        963.04
2815  2011-12-09   Friday     9     171679.08
2816  2011-12-09   Friday    10       2524.52
2817  2011-12-09   Friday    11       1638.74
2818  2011-12-09   Friday    12       2757.40

[5729 rows x 4 columns]

In [5]:
## conbine half day sales
sales['half_day'] = sales['hour'].apply(lambda x: 'am' if x < 13 else 'pm')
sales

            date  weekday  hour  total_amount half_day
0     2009-12-01  Tuesday     7        651.10       am
1     2009-12-01  Tuesday     9       4597.93       am
2     2009-12-01  Tuesday    10       4238.66       am
3     2009-12-01  Tuesday    11       4597.01       am
4     2009-12-01  Tuesday    12       8238.81       am
...          ...      ...   ...           ...      ...
2814  2011-12-09   Friday     8        963.04       am
2815  2011-12-09   Friday     9     171679.08       am
2816  2011-12-09   Friday    10       2524.52       am
2817  2011-12-09   Friday    11       1638.74       am
2818  2011-12-09   Friday    12       2757.40       am

[5729 rows x 5 columns]

In [6]:
sales['date'] = sales['date'].astype(str) + ' ' + sales['half_day']
sales

               date  weekday  hour  total_amount half_day
0     2009-12-01 am  Tuesday     7        651.10       am
1     2009-12-01 am  Tuesday     9       4597.93       am
2     2009-12-01 am  Tuesday    10       4238.66       am
3     2009-12-01 am  Tuesday    11       4597.01       am
4     2009-12-01 am  Tuesday    12       8238.81       am
...             ...      ...   ...           ...      ...
2814  2011-12-09 am   Friday     8        963.04       am
2815  2011-12-09 am   Friday     9     171679.08       am
2816  2011-12-09 am   Friday    10       2524.52       am
2817  2011-12-09 am   Friday    11       1638.74       am
2818  2011-12-09 am   Friday    12       2757.40       am

[5729 rows x 5 columns]

In [7]:
sales.drop(columns = ['hour', 'half_day','weekday'], inplace = True)
sales

               date  total_amount
0     2009-12-01 am        651.10
1     2009-12-01 am       4597.93
2     2009-12-01 am       4238.66
3     2009-12-01 am       4597.01
4     2009-12-01 am       8238.81
...             ...           ...
2814  2011-12-09 am        963.04
2815  2011-12-09 am     171679.08
2816  2011-12-09 am       2524.52
2817  2011-12-09 am       1638.74
2818  2011-12-09 am       2757.40

[5729 rows x 2 columns]

In [8]:
sales = sales.groupby(['date']).sum().reset_index()
sales

               date  total_amount
0     2009-12-01 am      22323.51
1     2009-12-01 pm      15042.81
2     2009-12-02 am      30036.27
3     2009-12-02 pm      15608.40
4     2009-12-03 am      19409.01
...             ...           ...
1202  2011-12-07 am      35652.05
1203  2011-12-07 pm      13601.42
1204  2011-12-08 am      15744.10
1205  2011-12-08 pm      31403.27
1206  2011-12-09 am     179562.78

[1207 rows x 2 columns]

In [9]:
sales.to_pickle('../Data/sales_half-day.pkl')